Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: You could just insert `sleep()` statements and hope for the best, but that makes your test behavior nondeterministic.
it_it: Si potrebbero semplicemente inserire le istruzioni `sleep()` e sperare per il meglio, ma ciò rende il comportamento del test non deterministico.

source: You could use either exceptions, the (ASSERT|EXPECT)_NO_FATAL_FAILURE assertions or the HasFatalFailure() function.
it_it: Potresti utilizzare le eccezioni, le asserzioni (ASSERT|EXPECT)_NO_FATAL_FAILURE o la funzione HasFatalFailure().

source: You could use either exceptions, the `(ASSERT|EXPECT)_NO_FATAL_FAILURE` assertions or the `HasFatalFailure()` function.
it_it: Potresti utilizzare le eccezioni, le asserzioni `(ASSERT|EXPECT)_NO_FATAL_FAILURE` o la funzione `HasFatalFailure()`.

source: You do this by wrapping the predicate inside the Truly() function, for example:
it_it: Lo si può fare racchiudendo il predicato all'interno della funzione Truly(), per esempio:

source: You do this by wrapping the predicate inside the `Truly()` function, for example:
it_it: Lo si può fare racchiudendo il predicato all'interno della funzione `Truly()`, per esempio:

source: You don't have to, but if you like, you may split up the test suite into FooTest and FooDeathTest, where the names make it clear that they are related:
it_it: Non è necessario, ma volendo, si può suddividere la test suite in FooTest e FooDeathTest, dove i nomi chiariscono che sono correlati:

source: You don't have to, but if you like, you may split up the test suite into `FooTest` and `FooDeathTest`, where the names make it clear that they are related:
it_it: Non è necessario, ma volendo, si può suddividere la test suite in `FooTest` e `FooDeathTest`, dove i nomi chiariscono che sono correlati:

source: You don't have to.
it_it: Non è necessario.

source: You don't need to define these mock methods somewhere else - the MOCK_METHOD macro will generate the definitions for you.
it_it: Non è necessario definire questi metodi mock da qualche altra parte: la macro MOCK_METHOD genererà le definizioni automaticamente.

source: You don't need to define these mock methods somewhere else - the `MOCK_METHOD` macro will generate the definitions for you.
it_it: Non è necessario definire questi metodi mock da qualche altra parte: la macro `MOCK_METHOD` genererà le definizioni automaticamente.

source: You get that automatically if you use the gtest_main library already.
it_it: Lo si ottiene automaticamente se si usa già la libreria gtest_main.

source: You get that automatically if you use the `gtest_main` library already.
it_it: Lo si ottiene automaticamente se si usa già la libreria `gtest_main`.

source: You got this error as gMock has no idea what value it should return when the mock method is called.
it_it: Hai ricevuto questo errore poiché gMock non ha idea di quale valore dovrebbe restituire quando viene chiamato il metodo mock.

source: You guessed it - you can use nested Pointee() to probe deeper inside the value.
it_it: Indovinato - si può usare Pointee() nidificato 'scavare' più a fondo il valore.

source: You guessed it - you can use nested `Pointee()` to probe deeper inside the value.
it_it: Indovinato - si può usare `Pointee()` nidificato 'scavare' più a fondo il valore.

source: You have a piece of code whose behavior is affected by one or more command-line flags.
it_it: Si ha una porzione di codice il cui comportamento è influenzato da uno o più flag della riga di comando.

source: You have a test using gMock.
it_it: Abbiamo un test che usa gMock.

source: You have to make sure that there are no race conditions or deadlocks in your program.
it_it: Non ci devono essere condizioni di race o deadlock nel programma.

source: You may also supply a custom failure message which will be appended to GoogleTest's message.
it_it: Si può anche avere un messaggio di errore personalizzato che verrà aggiunto al messaggio di GoogleTest.

source: You may append more than one listener to the list.
it_it: Si possono aggiungere più listener alla lista.

source: You may get the following warning:
it_it: Si potrebbe ricevere il seguente warning:

source: You may have guessed - it means that the function shouldn't be called with the given arguments at all, and gMock will report a googletest failure whenever the function is (wrongfully) called.
it_it: Come si intuisce - significa che la funzione non dovrebbe essere chiamata con gli argomenti forniti e gMock segnalerà un errore di googletest ogni volta che la funzione viene chiamata (erroneamente).

source: You may improve the matcher message by streaming additional information to the os argument in MatchAndExplain():
it_it: Il messaggio del matcher è migliorabile trasmettendo informazioni aggiuntive all'argomento os in MatchAndExplain():

source: You may improve the matcher message by streaming additional information to the `os` argument in `MatchAndExplain()`:
it_it: Il messaggio del matcher è migliorabile trasmettendo informazioni aggiuntive all'argomento `os` in `MatchAndExplain()`:

source: You may need to use Eq(nullopt) if the inner type doesn't have ==.)
it_it: Potrebbe essere necessario utilizzare Eq(nullopt) se il tipo interno non ha ==.)

source: You may need to use `Eq(nullopt)` if the inner type doesn't have `==`.)
it_it: Potrebbe essere necessario utilizzare `Eq(nullopt)` se il tipo interno non ha `==`.)

source: You may need to use this instead of Eq(value) when the mock function is overloaded.
it_it: Potrebbe essere necessario utilizzarlo al posto di Eq(value) quando la funzione mock è un overload.

source: You may need to use this instead of `Eq(value)` when the mock function is overloaded.
it_it: Potrebbe essere necessario utilizzarlo al posto di `Eq(value)` quando la funzione mock è un overload.

source: You may still want to use SetUp()/TearDown() in the following cases:
it_it: Si potrebbe comunque usare SetUp()/TearDown() nei seguenti casi:

source: You may still want to use `SetUp()/TearDown()` in the following cases:
it_it: Si potrebbe comunque usare `SetUp()/TearDown()` nei seguenti casi:

source: You may use failure-raising macros (EXPECT_*(), ASSERT_*(), FAIL(), etc) when processing an event.
it_it: Si possono utilizzare macro che generano errori (EXPECT_*(), ASSERT_*(), FAIL(), ecc.) durante l'elaborazione di un evento.

source: You may use failure-raising macros (`EXPECT_*()`, `ASSERT_*()`, `FAIL()`, etc) when processing an event.
it_it: Si possono utilizzare macro che generano errori (`EXPECT_*()`, `ASSERT_*()`, `FAIL()`, ecc.) durante l'elaborazione di un evento.

source: You may use this API to augment or replace the standard console output, replace the XML output, or provide a completely different form of output, such as a GUI or a database.
it_it: Questa API è utilizzabile per aumentare o sostituire l'output della console standard, sostituire l'output XML o fornire una forma di output completamente diversa, come una GUI o un database.

source: You might want to run your test with --gmock_verbose=info.
it_it: Potresti voler eseguire il test con --gmock_verbose=info.

source: You might want to run your test with `--gmock_verbose=info`.
it_it: Potresti voler eseguire il test con `--gmock_verbose=info`.

source: You must always put a mock method definition (MOCK_METHOD) in a public: section of the mock class, regardless of the method being mocked being public, protected, or private in the base class.
it_it: Si deve sempre inserire una definizione del metodo mock (MOCK_METHOD) in una sezione public: della classe mock, indipendentemente dal fatto che il metodo mocked sia public, protected, o private nella classe base.

source: You must always put a mock method definition (`MOCK_METHOD`) in a `public:` section of the mock class, regardless of the method being mocked being `public`, `protected`, or `private` in the base class.
it_it: Si deve sempre inserire una definizione del metodo mock (`MOCK_METHOD`) in una sezione `public:` della classe mock, indipendentemente dal fatto che il metodo mocked sia `public`, `protected`, o `private` nella classe base.

source: You need DoAll() to chain a SetArgPointee() with a Return() that provides a value appropriate to the API being mocked.
it_it: È necessario che DoAll() concateni un SetArgPointee() con un Return() che fornisca un valore appropriato all'API mock-ata.

source: You need `DoAll()` to chain a `SetArgPointee()` with a `Return()` that provides a value appropriate to the API being mocked.
it_it: È necessario che `DoAll()` concateni un `SetArgPointee()` con un `Return()` che fornisca un valore appropriato all'API mock-ata.

source: You need to make sure that `*result` contains some sensible value even when the function returns prematurely.
it_it: `*result` deve contenere un valore sensato anche quando la funzione ritorna prematuramente.

source: You need to make sure that your module interacts with other modules in the right way, but it's hard to observe the interaction; therefore you resort to observing the side effects at the end of the action, but it's awkward at best.
it_it: Si vuol essere certi che un modulo interagisca con gli altri moduli nel modo giusto, ma è difficile osservare l'interazione; quindi si ricorre all'osservazione degli effetti collaterali alla fine dell'azione, ma nella migliore delle ipotesi è imbarazzante.

source: You need to weigh the pros and cons carefully for your particular problem, but I'd like to assure you that the Java community has been practicing this for a long time and it's a proven effective technique applicable in a wide variety of situations.
it_it: Si devono valutare attentamente i pro e i contro per il problema particolare, ma certamente la comunità Java lo pratica da molto tempo ed è una tecnica comprovata ed efficace applicabile in un'ampia varietà di situazioni.

source: You only need to specify an action if this default value doesn't work for you.
it_it: Si deve solo specificare un'azione se questo valore di default non corrisponde alle proprie esigenze.

source: You pay the cost of virtual function calls (usually not a problem).
it_it: Si paga il costo delle chiamate di funzioni virtuali (di solito non è un problema).

source: You should call AddGlobalTestEnvironment() before RUN_ALL_TESTS() is called, probably in main().
it_it: Si deve chiamare AddGlobalTestEnvironment() prima di chiamare RUN_ALL_TESTS(), probabilmente in main().

source: You should call `AddGlobalTestEnvironment()` before `RUN_ALL_TESTS()` is called, probably in `main()`.
it_it: Si deve chiamare `AddGlobalTestEnvironment()` prima di chiamare `RUN_ALL_TESTS()`, probabilmente in `main()`.

source: You should group your tests into test suites that reflect the structure of the tested code.
it_it: I test si dovrebbero raggruppare in test suite che riflettono la struttura del codice in esame.

source: You should let MatchAndExplain() print any additional information that can help a user understand the match result.
it_it: Si dovrebbe consentire a MatchAndExplain() di stampare qualsiasi informazione aggiuntiva che possa aiutare un utente a comprendere il risultato della corrispondenza [match].

source: You should let `MatchAndExplain()` print *any additional information* that can help a user understand the match result.
it_it: Si dovrebbe consentire a `MatchAndExplain()` di stampare *qualsiasi informazione aggiuntiva* che possa aiutare un utente a comprendere il risultato della corrispondenza [match].

source: You still have to fix the disabled tests at a later date.
it_it: Resta ancora correggere i test disabilitati in un secondo momento.

source: You test a class or function by making assertions about its behavior.
it_it: Una classe o una funzione si può testare facendo asserzioni sul suo comportamento.

source: You then use TEST_F() to write tests using each derived fixture.
it_it: Poi si usa TEST_F() per scrivere i test utilizzando ciascuna fixture derivata.

source: You then use `TEST_F()` to write tests using each derived fixture.
it_it: Poi si usa `TEST_F()` per scrivere i test utilizzando ciascuna fixture derivata.

source: You use this type of assertion to check if a proper error message is emitted in case of bad input to a routine or if the process exits with a proper exit code.
it_it: Si utilizza questo tipo di asserzione per verificare se viene emesso un messaggio di errore corretto in caso di input errato in una routine o se il processo termina con un codice di uscita appropriato.

source: You want to do it just right such that your test can catch exactly the kind of bugs you intend it to catch.
it_it: Lo si vuole fare nel modo giusto in modo che il test possa rilevare esattamente il tipo di bug che si intende rilevare.

source: You want to "mock out" your dependencies, except that they don't have mock implementations yet; and, frankly, you aren't thrilled by some of those hand-written mocks.
it_it: Si vogliono "simulare [mock] le dipendenze, tranne per il fatto che non ci sono ancora implementazioni mock; e, francamente, non si è entusiasti di alcune di quelle scritte a mano.

source: You want to constrain that the argument's bar() value plus its baz() value is a given number.
it_it: Si vuol vincolare il fatto che il valore dell'argomento di bar() più il valore del suo baz() sia un certo numero.

source: You want to constrain that the argument's `bar()` value plus its `baz()` value is a given number.
it_it: Si vuol vincolare il fatto che il valore dell'argomento di `bar()` più il valore del suo `baz()` sia un certo numero.

source: You want to make sure your code performs correctly for various values of those flags.
it_it: Si vuole essere sicuri che il codice funzioni correttamente per vari valori di questi flag.

source: You want to test different implementations of an OO interface.
it_it: Si vogliono testare diverse implementazioni di un'interfaccia OO.

source: You want to test how your code handles a failure (e.g. a file checksum error), but it's not easy to cause one.
it_it: Si vuol testare il modo in cui il codice gestisce un errore (ad esempio un errore di checksum del file), ma non è facile causarne uno.

source: You want to test your code over various inputs (a.k.a.
it_it: Si vuol testare il codice su vari input (ovvero

source: You will need to define a function that returns the iteration name and pass it as the third parameter to INSTANTIATE_TEST_SUITE_P to have more useful output.
it_it: Sarà necessario definire una funzione che restituisca il nome dell'iterazione e passarla come terzo parametro a INSTANTIATE_TEST_SUITE_P per avere un output più utile.

source: You'll use this file to set up your project and declare a dependency on GoogleTest.
it_it: Si utilizzerà questo file per impostare il progetto e per dichiarare una dipendenza da GoogleTest.

source: You're probably using an ASSERT_*() in a function that doesn't return void.
it_it: Probabilmente si sta utilizzando un ASSERT_*() in una funzione che non restituisce void.

source: You're probably using an `ASSERT_*()` in a function that doesn't return `void`.
it_it: Probabilmente si sta utilizzando un `ASSERT_*()` in una funzione che non restituisce `void`.

source: You've learned how to change the default value of a given type.
it_it: Abbiamo imparato come modificare il valore di default di un determinato tipo.

source: You've successfully built and run a test binary using GoogleTest.
it_it: È stato creato ed eseguito correttamente un file binario di prova utilizzando GoogleTest.

source: Your clients aren't allowed to include this header but your tests can.
it_it: I clienti non sono autorizzati a includere questo header, ma i test sì.

source: Your code should talk to FileInterface to open a file.
it_it: Il codice dovrebbe comunicare con FileInterface per aprire un file.

source: Your code should talk to `FileInterface` to open a file.
it_it: Il codice dovrebbe comunicare con `FileInterface` per aprire un file.

source: Your code uses these types:
it_it: Il codice utilizza questi tipi:

source: Your production .cc files and your tests are allowed to include this internal header, but your clients are not.
it_it: I file .cc di produzione e i test possono includere questo header interno, ma i non i clienti.

source: Your production `.cc` files and your tests are allowed to include this internal header, but your clients are not.
it_it: I file `.cc` di produzione e i test possono includere questo header interno, ma i non i clienti.

source: Your program will normally use a real implementation of this interface.
it_it: Il programma normalmente utilizzerà un'implementazione reale di questa interfaccia.

source: Your project may have tests that were written without GoogleTest and thus don't understand this protocol.
it_it: Il progetto potrebbe contenere test scritti senza GoogleTest e quindi non capire questo protocollo.

source: Your test code should be something like:
it_it: Il codice del test dovrebbe essere qualcosa del tipo:

source: Your tests are brittle as some resources they use are unreliable (e.g. the network).
it_it: I test sono fragili poiché alcune risorse che utilizzano sono inaffidabili (ad esempio la rete).

source: Your tests are slow as they depend on too many libraries or use expensive resources (e.g. a database).
it_it: I test sono lenti poiché dipendono da troppe librerie o utilizzano risorse costose (ad esempio un database).

source: [**Actions**](../gmock_for_dummies.md#actions-what-should-it-do) specify what a mock function should do when invoked.
it_it: Le [**action**](../gmock_for_dummies.md#actions-what-should-it-do) specificano cosa dovrebbe fare una funzione mock quando viene invocata.

source: [Assertions](assertions.md) used within the test body determine the outcome of the test.
it_it: Le [asserzioni](assertions.md) utilizzate all'interno del corpo del test determinano l'esito del test.

source: [Bazel](https://bazel.build/), the preferred build system used by the GoogleTest team.
it_it: [Bazel](https://bazel.build/), è il sistema di build preferito utilizzato dal team di GoogleTest.

source: [CMake](https://cmake.org/) and a compatible build tool for building the project.
it_it: [CMake](https://cmake.org/) e uno strumento di build compatibile per il progetto.

source: [Check out the Primer](primer.md) to start learning how to write simple tests.
it_it: [Consultare la Guida](primer.md) per iniziare a scrivere semplici test.

source: [GoogleTest Advanced](advanced.md) - Read this when you've finished the Primer and want to utilize GoogleTest to its full potential.
it_it: [GoogleTest Advanced](advanced.md) - Leggere questo, dopo la Guida per utilizzare GoogleTest al massimo delle sue potenzialità.

source: [GoogleTest FAQ](faq.md) - Have a question?
it_it: [FAQ di GoogleTest](faq.md) - Ci sono domande?

source: [GoogleTest Primer](primer.md) - Teaches you how to write simple tests using GoogleTest.
it_it: [Guida di GoogleTest](primer.md) - Insegna come scrivere semplici test utilizzando GoogleTest.

source: [GoogleTest Samples](samples.md) - Describes some GoogleTest samples.
it_it: [Esempi di Googletest](samples.md) - Descrive degli esempi di GoogleTest.

source: [Googlemock Insights](https://github.com/ElectricRCAircraftGuy/eRCaGuy_dotfiles/blob/master/googletest/insights.md), by [ElectricRCAircraftGuy](https://github.com/ElectricRCAircraftGuy)
it_it: [Googlemock Insights](https://github.com/ElectricRCAircraftGuy/eRCaGuy_dotfiles/blob/master/googletest/insights.md), di [ElectricRCAircraftGuy](https://github.com/ElectricRCAircraftGuy)

source: [ISTQB](https://www.istqb.org/) Term
it_it: Termine [ISTQB](https://www.istqb.org/)

source: [Mocking Cheat Sheet](gmock_cheat_sheet.md) - A handy reference for matchers, actions, invariants, and more.
it_it: [Cheat Sheet del Mocking](gmock_cheat_sheet.md) - Un pratico riferimento per matcher, azioni, invarianti e altro.

source: [Mocking Cookbook](gmock_cook_book.md) - Includes tips and approaches to common mocking use cases.
it_it: [Mocking Cookbook](gmock_cook_book.md) - Include suggerimenti e approcci ai casi d'uso comuni di mocking.

source: [Mocking FAQ](gmock_faq.md) - Contains answers to some mocking-specific questions.
it_it: [Mocking FAQ](gmock_faq.md) - Contiene le risposte ad alcune domande specifiche sul mocking.

source: [Mocking for Dummies](gmock_for_dummies.md) - Teaches you how to create mock objects and use them in tests.
it_it: [Mocking per Principianti](gmock_for_dummies.md) - Insegna come creare oggetti mock e come utilizzarli nei test.

source: [See the code samples](samples.md) for more examples showing how to use a variety of GoogleTest features.
it_it: [Esaminare gli esempi di codice](samples.md) per altri esempi che mostrano come utilizzare le varie funzioni di GoogleTest.

source: [The GoogleTest advanced guide](advanced.md#teaching-googletest-how-to-print-your-values) explains how to extend the printer to do a better job at printing your particular type than to dump the bytes.
it_it: [La Guida Avanzata di GoogleTest](advanced.md#teaching-googletest-how-to-print-your-values) spiega come estendere la stampante per eseguire un lavoro migliore stampando il tipo particolare piuttosto che il dump dei byte.

source: [safely casts](../gmock_cook_book.md#SafeMatcherCast) matcher `m` to type `Matcher<T>`.
it_it: [esegue il cast in modo sicuro](../gmock_cook_book.md#SafeMatcherCast) il matcher `m` nel tipo `Matcher<T>`.

source: `"gtest/gtest-spi.h"` contains some constructs to do this.
it_it: `"gtest/gtest-spi.h"` contiene alcuni costrutti per farlo.

source: `./foo_test --gtest_filter=*Null*:*Constructor*` Runs any test whose full name contains either `"Null"` or `"Constructor"` .
it_it: `./foo_test --gtest_filter=*Null*:*Constructor*` Esegue qualsiasi test il cui nome completo contenga `"Null"` o `"Constructor"` .

source: `./foo_test --gtest_filter=*` Also runs everything, due to the single match-everything `*` value.
it_it: `./foo_test --gtest_filter=*` Esegue tutto, a causa del singolo valore `*` corrispondente a tutto.

source: `./foo_test --gtest_filter=-*DeathTest.*` Runs all non-death tests.
it_it: `./foo_test --gtest_filter=-*DeathTest.*` Esegue tutti i test non-death.

source: `./foo_test --gtest_filter=FooTest.*-FooTest.Bar` Runs everything in test suite `FooTest` except `FooTest.Bar`.
it_it: `./foo_test --gtest_filter=FooTest.*-FooTest.Bar` Esegue tutto nella test suite `FooTest` tranne `FooTest.Bar`.

source: `./foo_test --gtest_filter=FooTest.*:BarTest.*-FooTest.Bar:BarTest.Foo` Runs everything in test suite `FooTest` except `FooTest.Bar` and everything in test suite `BarTest` except `BarTest.Foo`.
it_it: `./foo_test --gtest_filter=FooTest.*:BarTest.*-FooTest.Bar:BarTest.Foo` Esegue tutto nella test suite `FooTest` tranne `FooTest.Bar` e tutto nella test suite `BarTest` tranne `BarTest.Foo`.

source: `./foo_test --gtest_filter=FooTest.*` Runs everything in test suite `FooTest` .
it_it: `./foo_test --gtest_filter=FooTest.*` Esegue tutto nella test suite `FooTest` .

source: `./foo_test` Has no flag, and thus runs all its tests.
it_it: `./foo_test` Non ha flag e quindi esegue tutti i suoi test.

source: `<testcase>` elements correspond to GoogleTest test functions.
it_it: Gli elementi `<testcase>` corrispondono alle funzioni di test di GoogleTest.

source: `<testsuite>` elements correspond to GoogleTest test suites.
it_it: Gli elementi `<testsuite>` corrispondono alle test suite di GoogleTest.

source: `A<type>()` or `An<type>()`
it_it: `A<type>()` o `An<type>()`

source: `ACTION_TEMPLATE()` supports that and can be viewed as an extension to `ACTION()` and `ACTION_P*()`.
it_it: `ACTION_TEMPLATE()` lo supporta e può essere visto come un'estensione di `ACTION()` e di `ACTION_P*()`.
